In [39]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

### Q5

In [40]:
gdp_df = pd.read_csv('../data/gdp_percapita.csv',nrows=6729)
gdp_df.tail(6)

     Country or Area  Year        Value  Value Footnotes
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN
6728        Zimbabwe  1990  2819.549467              NaN

### Q6

In [41]:
internet_df = pd.read_csv('../data/internet_use.csv', nrows=4495)
#limited rows to 4496 with nrow=
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

### Q7: Look at the shape of each dataframe - how many rows, how many columns.

In [42]:
gdp_df.shape

(6729, 4)

In [43]:
internet_df.shape

(4495, 4)

### Q8. Take a look at the data types for the columns in each table.

In [44]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [45]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

Personal Question: Why do the following differ?

In [46]:
internet_df.Value.dtypes

dtype('float64')

In [47]:
type(internet_df.Value)

pandas.core.series.Series

#### Q9 take a look at the last 10 rows of each dataset in turn.

In [48]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6719        Zimbabwe  1999  3054.064189              NaN
6720        Zimbabwe  1998  3099.076182              NaN
6721        Zimbabwe  1997  3036.422224              NaN
6722        Zimbabwe  1996  2985.856605              NaN
6723        Zimbabwe  1995  2736.486436              NaN
6724        Zimbabwe  1994  2768.309953              NaN
6725        Zimbabwe  1993  2572.870395              NaN
6726        Zimbabwe  1992  2591.007534              NaN
6727        Zimbabwe  1991  2906.272849              NaN
6728        Zimbabwe  1990  2819.549467              NaN

In [49]:
internet_df.tail(10)

     Country or Area  Year     Value  Value Footnotes
4485        Zimbabwe  2002  3.994356              NaN
4486        Zimbabwe  2001  0.799846              NaN
4487        Zimbabwe  2000  0.401434              NaN
4488        Zimbabwe  1999  0.161676              NaN
4489        Zimbabwe  1998  0.081648              NaN
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

#### Q10: Drop the 'value footnotes' data (column) from both datasets. Check that this worked as expected.

In [50]:
type(gdp_df)

pandas.core.frame.DataFrame

In [51]:
gdp_df = gdp_df.drop(columns = ['Value Footnotes'])

In [52]:
internet_df = internet_df.drop(columns = ['Value Footnotes'])

#### Q11: Change the columns for the GDP Per Capita data frame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [60]:
gdp_df = gdp_df.rename(columns = {'Country or Area': 'Country', 'Value': 'GDP_Per_Capita'})

#### Q12: Change the columns for the Internet Users data frame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [54]:
internet_df.columns = ['Country','Year','Internet_Users_Pct']
internet_df.head(20)

        Country  Year  Internet_Users_Pct
0   Afghanistan  2014            6.390000
1   Afghanistan  2013            5.900000
2   Afghanistan  2012            5.454545
3   Afghanistan  2011            5.000000
4   Afghanistan  2010            4.000000
5   Afghanistan  2009            3.550000
6   Afghanistan  2008            1.840000
7   Afghanistan  2007            1.900000
8   Afghanistan  2006            2.107124
9   Afghanistan  2005            1.224148
10  Afghanistan  2004            0.105809
11  Afghanistan  2003            0.087891
12  Afghanistan  2002            0.004561
13  Afghanistan  2001            0.004723
14  Afghanistan  1990            0.000000
15      Albania  2014           60.100000
16      Albania  2013           57.200000
17      Albania  2012           54.655959
18      Albania  2011           49.000000
19      Albania  2010           45.000000

#### Q13: Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [55]:
internet_df.astype({'Year': 'int64'}).dtypes

Country                object
Year                    int64
Internet_Users_Pct    float64
dtype: object

In [62]:
gdp_and_internet_use= pd.merge(gdp_df, internet_df, on = ['Country','Year'], how ='outer')

In [61]:
gdp_df

          Country  Year  GDP_Per_Capita
0     Afghanistan  2018     1734.723214
1     Afghanistan  2017     1758.465636
2     Afghanistan  2016     1757.023490
3     Afghanistan  2015     1766.593077
4     Afghanistan  2014     1795.735834
...           ...   ...             ...
6724     Zimbabwe  1994     2768.309953
6725     Zimbabwe  1993     2572.870395
6726     Zimbabwe  1992     2591.007534
6727     Zimbabwe  1991     2906.272849
6728     Zimbabwe  1990     2819.549467

[6729 rows x 3 columns]

#### Q14: Look at the first five rows of your new data frame to confirm it merged correctly.

In [64]:
gdp_and_internet_use.head(5)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     1734.723214                 NaN
1  Afghanistan  2017     1758.465636                 NaN
2  Afghanistan  2016     1757.023490                 NaN
3  Afghanistan  2015     1766.593077                 NaN
4  Afghanistan  2014     1795.735834                6.39

#### Q15: Look at the last five rows to make sure the data is clean and as expected.

In [65]:
gdp_and_internet_use.tail(5)

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
7700  Virgin Islands (U.S.)  1997             NaN            6.948369
7701  Virgin Islands (U.S.)  1996             NaN            4.647186
7702  Virgin Islands (U.S.)  1995             NaN            2.801958
7703  Virgin Islands (U.S.)  1994             NaN            0.940645
7704  Virgin Islands (U.S.)  1990             NaN            0.000000

#### Q16: Subset the combined data frame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [84]:
my_years = ['2004','2009','2014']
gdp_and_internet_use_my_years = gdp_and_internet_use.query('Year in @my_years')
gdp_and_internet_use_my_years
##created dictionary and referenced it with @

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     1795.735834            6.390000
9               Afghanistan  2009     1502.354073            3.550000
14              Afghanistan  2004     1025.208245            0.105809
21                  Albania  2014    10700.993216           60.100000
26                  Albania  2009     9525.377979           41.200000
...                     ...   ...             ...                 ...
7668               Viet Nam  2009             NaN           26.550000
7673               Viet Nam  2004             NaN            7.642409
7683  Virgin Islands (U.S.)  2014             NaN           50.070000
7688  Virgin Islands (U.S.)  2009             NaN           27.396510
7693  Virgin Islands (U.S.)  2004             NaN           27.377009

[835 rows x 4 columns]

#### Q17: Create three new data frames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

In [85]:
gdp_and_internet_use_2004 = gdp_and_internet_use_my_years.query('Year == 2004')
gdp_and_internet_use_2009 = gdp_and_internet_use_my_years.query('Year == 2009')
gdp_and_internet_use_2014 = gdp_and_internet_use_my_years.query('Year == 2014')

#### Q18: Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab for auto-complete options).

In [98]:
## using sort_values() function on 2014 dataframe
gdp_and_internet_use_2014.sort_values(by = 'Internet_Users_Pct', ascending = False).head(1)

      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2581  Iceland  2014    42774.888849               98.16

#### Q19: Which country had the lowest percentage of internet users in 2014? What was the percentage?

In [97]:
gdp_and_internet_use_2014.sort_values(by = 'Internet_Users_Pct', ascending = True).head(1)

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
6940  Dem. People's Rep. of Korea  2014             NaN                 0.0

#### Q20: Repeat for 2004 and 2009.

In [99]:
gdp_and_internet_use_2004.sort_values(by = 'Internet_Users_Pct', ascending = False).head(1)

     Country  Year  GDP_Per_Capita  Internet_Users_Pct
5852  Sweden  2004    40177.850408               83.89

In [101]:
gdp_and_internet_use_2004.sort_values(by = 'Internet_Users_Pct', ascending = True).head(1)

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
6949  Dem. People's Rep. of Korea  2004             NaN                 0.0

In [102]:
gdp_and_internet_use_2009.sort_values(by = 'Internet_Users_Pct', ascending = False).head(1)

      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2586  Iceland  2009    41505.084834                93.0

In [103]:
gdp_and_internet_use_2009.sort_values(by = 'Internet_Users_Pct', ascending = True).head(1)

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
6944  Dem. People's Rep. of Korea  2009             NaN                 0.0